"""
    字典的定义
        - dictionary(字典)是除列表以外Python之中最灵活的数据类型
            - 字典同样可以用来存储多个数据
                - 通常用来存储 描述一个物体的相关信息
            - 和列表的区别
                - 列表是有序的对象集合
                - 字典是无序的对象集合
            - 字典用 {} 定义
            - 字典使用键值对存储数据，键值对之间使用 , 分隔
                - 键（key）是索引
                - 值（value）是数据
                - 键和值之间使用 ： 分隔
                - 键必须是唯一的
                - 值可以是任何数据类型，但键只能使用字符串、数字或元组
            - 字典是一个无序的数据集合，使用print函数输出字典时，通常输出的顺序和定义的顺序是不一致的
        - 应用场景
            使用多个键值对，存储描述一个物体的相关信息 ---描述更复杂的数据信息
            将多个字典放在一个列表中，再进行遍历
"""